In [26]:
import numpy as np
seven_by_three_array = np.array([[1,2,3,4,5,6,7], [8,9,10,11,12,13,14],[15,16,17,18,19,20,21]])
seven_by_three_array.astype(np.float32)

array([[ 1.,  2.,  3.,  4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11., 12., 13., 14.],
       [15., 16., 17., 18., 19., 20., 21.]], dtype=float32)

In [7]:
# converting to a pandas dataframe
import pandas as pd
pad_dataframe = pd.DataFrame(seven_by_three_array,columns = ['A', 'B', 'C','D', 'E', 'F', 'G'],
                            index = [1,2,3])
pad_dataframe

    A   B   C   D   E   F   G
1   1   2   3   4   5   6   7
2   8   9  10  11  12  13  14
3  15  16  17  18  19  20  21

In [8]:
# display the first 2 rows
pad_dataframe.head(2)

   A  B   C   D   E   F   G
1  1  2   3   4   5   6   7
2  8  9  10  11  12  13  14

In [9]:
pad_dataframe.drop('A', axis = 1)

    B   C   D   E   F   G
1   2   3   4   5   6   7
2   9  10  11  12  13  14
3  16  17  18  19  20  21

In [10]:
#to drop an entire row from your pandas dataframe
pad_dataframe.drop(1, axis = 0)

    A   B   C   D   E   F   G
2   8   9  10  11  12  13  14
3  15  16  17  18  19  20  21

In [11]:
pad_dataframe

    A   B   C   D   E   F   G
1   1   2   3   4   5   6   7
2   8   9  10  11  12  13  14
3  15  16  17  18  19  20  21

In [13]:
# we are checking if our dataframe has null values/invalid values
np.sum(pad_dataframe.isnull())

A    0
B    0
C    0
D    0
E    0
F    0
G    0
dtype: int64

In [15]:
# to check for columns in our dataframe we use
pad_dataframe.columns

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G'], dtype='object')

In [16]:
# to print out the 'C' column we do this
pad_dataframe['C']

1     3
2    10
3    17
Name: C, dtype: int64

In [17]:
pad_dataframe.describe()

          A     B     C     D     E     F     G
count   3.0   3.0   3.0   3.0   3.0   3.0   3.0
mean    8.0   9.0  10.0  11.0  12.0  13.0  14.0
std     7.0   7.0   7.0   7.0   7.0   7.0   7.0
min     1.0   2.0   3.0   4.0   5.0   6.0   7.0
25%     4.5   5.5   6.5   7.5   8.5   9.5  10.5
50%     8.0   9.0  10.0  11.0  12.0  13.0  14.0
75%    11.5  12.5  13.5  14.5  15.5  16.5  17.5
max    15.0  16.0  17.0  18.0  19.0  20.0  21.0

In [18]:
# information regarding your data, their datatypes, names e.t.c.

pad_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 1 to 3
Data columns (total 7 columns):
A    3 non-null int64
B    3 non-null int64
C    3 non-null int64
D    3 non-null int64
E    3 non-null int64
F    3 non-null int64
G    3 non-null int64
dtypes: int64(7)
memory usage: 272.0 bytes

Other attributes of pandas include .append(), .diff(), .intersection(), .union(), .isin(), .delete(), .drop(), .insert(), .is_unique(), .unique()

### Statistics

In [19]:
# to find the mean of each column
pad_dataframe.mean()

A     8.0
B     9.0
C    10.0
D    11.0
E    12.0
F    13.0
G    14.0
dtype: float64

In [20]:
# to find the standard deviation we have
pad_dataframe.std()

A    7.0
B    7.0
C    7.0
D    7.0
E    7.0
F    7.0
G    7.0
dtype: float64

In [21]:
# to find the median 
pad_dataframe.median()

A     8.0
B     9.0
C    10.0
D    11.0
E    12.0
F    13.0
G    14.0
dtype: float64

In [22]:
# to find the variance we have
pad_dataframe.var()

A    49.0
B    49.0
C    49.0
D    49.0
E    49.0
F    49.0
G    49.0
dtype: float64

In [23]:
# to find the min value and max value
pad_dataframe.min(), pad_dataframe.max()

(A    1
 B    2
 C    3
 D    4
 E    5
 F    6
 G    7
 dtype: int64, A    15
 B    16
 C    17
 D    18
 E    19
 F    20
 G    21
 dtype: int64)

others include .value_counts(), .unique()

## data loading and data storage using pandas

how do we read a data into our pandas dataframe
we do this by using pd.read_csv(for comma separable variable files)
pd.read_txt(for text files)
pd.read_excel(for .xlx file)

In [27]:
read_data = pd.read_csv('application_data.csv')

In [28]:
read_data.shape

(1000, 9)

In [29]:
read_data.columns

Index(['customerID', 'loanId', 'appilcationDate', 'LoanNumber', 'LoanAmount',
       'InterestRate', 'TermDays', 'repaymentDueDate', 'repaymentPaidDate'],
      dtype='object')

In [31]:
read_data.head()

,customerID,loanId,appilcationDate,LoanNumber,LoanAmount,InterestRate,TermDays,repaymentDueDate,repaymentPaidDate
0,839247458,302953235622,2018-12-21,1,7500.0,30.0,30,2019-01-20,2019-01-16
1,217540860,302960101337,2018-12-23,1,7500.0,30.0,30,2019-01-22,2018-12-29
2,522238092,303016988846,2019-01-08,1,7500.0,30.0,30,2019-02-07,2019-01-08
3,096754469,302999605504,2019-01-04,1,7500.0,30.0,30,2019-02-03,2019-01-08
4,410354345,302951945878,2018-12-21,1,7500.0,30.0,30,2019-01-20,2019-01-17

In [35]:
read_data.to_excel('application.xlsx')

In [36]:
import os, sys
os.getcwd()

'/home/odemakinde/Desktop'

In [ ]:
directory = '/home/odemakinde/pictures/game/housing.csv'
train_data = pd.read_csv(directory)